src/Documents/уатЖурналПредрейсовогоИПослерейсовогоКонтроляТС/уатЖурналПредрейсовогоИПослерейсовогоКонтроляТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатЖурналПредрейсовогоИПослерейсовогоКонтроляТС</name>
  <basedOn>Document.уатПутевойЛист</basedOn>
  <attributes>
    <name>ВидКонтроля</name>
    <type>
      <types>EnumRef.уатВидыКонтроляТранспортныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Журнал</name>
    <type>
      <types>CatalogRef.уатЖурналыТранспортныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контролер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение организации</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТС</name>
    <type>
      <types>CatalogRef.уатТС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутевойЛист</name>
    <type>
      <types>DocumentRef.уатПутевойЛист</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.уатСтатусы_уэ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РезультатыОсмотра</name>
    <attributes>
      <name>Требование</name>
      <type>
        <types>CatalogRef.уатТребованияКонтроляТС</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>DefinedType.уатТипыЗначенийТребованийКонтроляТСиВодителей</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.уатСтатусы_уэ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Прицепы</name>
    <attributes>
      <name>ТС</name>
      <type>
        <types>CatalogRef.уатТС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/уатВидыКонтроляТранспортныхДокументов/уатВидыКонтроляТранспортныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВидыКонтроляТранспортныхДокументов</name>
  <enumValues>
    <name>Предрейсовый</name>
  </enumValues>
  <enumValues>
    <name>Послерейсовый</name>
  </enumValues>
</mdclass:Enum>

src/Documents/уатЖурналПредрейсовогоИПослерейсовогоКонтроляТС/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатПутевойЛист") Тогда
		Организация   = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ПутевойЛист   = ДанныеЗаполнения.Ссылка;
		ВидКонтроля   = Перечисления.уатВидыКонтроляТранспортныхДокументов.Предрейсовый;
		Контролер     = ПутевойЛист.ВыпустилМеханик;
		ТС            = ПутевойЛист.ТранспортноеСредство;
		Для Каждого ТекПрицеп Из ПутевойЛист.Прицепы Цикл
			НоваяСтрока = Прицепы.Добавить();
			НоваяСтрока.ТС = ТекПрицеп.ТС;
		КонецЦикла;
	
		СозданныеДокументы = уатЖурналыТранспортныхДокументов.СозданныеДокументыКонтроляТСПоПЛ(ПутевойЛист);
		
		Если СозданныеДокументы.Предрейсовый <> Неопределено И СозданныеДокументы.Послерейсовый = Неопределено Тогда
			ВидКонтроля = Перечисления.уатВидыКонтроляТранспортныхДокументов.Послерейсовый;
			Контролер = ПутевойЛист.ПринялМеханик;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ЭтотОбъект);
	
	// проверка на существование уже созданного документа
	Если уатЖурналыТранспортныхДокументов.УжеСозданДокументКонтроляТС(ПутевойЛист, ВидКонтроля, Ссылка) Тогда
		ТекстНСТР = СтрШаблон("Запись журнала %1 контроля ТС для ""%2"" уже создана!",
			?(ВидКонтроля = Перечисления.уатВидыКонтроляТранспортныхДокументов.Предрейсовый, "предрейсового", "послерейсового"),
			ПутевойЛист);
		уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ, Заголовок);
	КонецЕсли;
	
	// проверка на нарушение минимального интервала ПЛ
	Если НЕ Отказ И ЗначениеЗаполнено(Дата) Тогда
		МинИнтервалПЛ = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация,
			ПланыВидовХарактеристик.уатПраваИНастройки.МинимальныйИнтервалМеждуПредрейсовымИПослерейсовымОсмотром);
			
		Если МинИнтервалПЛ > 0 Тогда
			ИнтервалПоЖурналу = Неопределено;
			
			СозданныеДокументы = уатЖурналыТранспортныхДокументов.СозданныеДокументыКонтроляТСПоПЛ(ПутевойЛист);
			
			Если ВидКонтроля = Перечисления.уатВидыКонтроляТранспортныхДокументов.Предрейсовый Тогда
				ДокументКонтрольДругой = СозданныеДокументы.Послерейсовый;
				Если ЗначениеЗаполнено(ДокументКонтрольДругой) Тогда
					ИнтервалПоЖурналу = ДокументКонтрольДругой.Дата - Дата;
					ДатаПредрейсовый  = Дата;
					ДатаПослерейсовый = ДокументКонтрольДругой.Дата;
				КонецЕсли;
			Иначе
				ДокументКонтрольДругой = СозданныеДокументы.Предрейсовый;
				Если ЗначениеЗаполнено(ДокументКонтрольДругой) Тогда
					ИнтервалПоЖурналу = Дата - ДокументКонтрольДругой.Дата;
					ДатаПредрейсовый  = ДокументКонтрольДругой.Дата;
					ДатаПослерейсовый = Дата;
				КонецЕсли;
			КонецЕсли;
			
			Если ИнтервалПоЖурналу <> Неопределено И ИнтервалПоЖурналу < МинИнтервалПЛ*60 Тогда
				Если НачалоДня(ДатаПредрейсовый) = НачалоДня(ДатаПослерейсовый) Тогда
					ДатаПредрейсовый  = Формат(ДатаПредрейсовый,  "ДФ=HH:mm");
					ДатаПослерейсовый = Формат(ДатаПослерейсовый, "ДФ=HH:mm");
				Иначе
					ДатаПредрейсовый  = Формат(ДатаПредрейсовый,  "ДФ='dd.MM.yyyy HH:mm'");
					ДатаПослерейсовый = Формат(ДатаПослерейсовый, "ДФ='dd.MM.yyyy HH:mm'");
				КонецЕсли;
				
				ТекстНСТР = СтрШаблон(
					"Интервал между предрейсовым и послерейсовым контролем состояния ТС не должен быть меньше %1 минут!
					|Время предрейсового осмотра: %2
					|Время послерейсового осмотра: %3",
					МинИнтервалПЛ, ДатаПредрейсовый, ДатаПослерейсовый);
				уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		уатЖурналыТранспортныхДокументов.ИзменитьСостоянияПодписейПЛ(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ЭтотОбъект);
	уатОбщегоНазначения.ПроверкаЗаполненияПодразделения(Организация, Подразделение, Отказ, Заголовок);
	
	Если ЗначениеЗаполнено(ПутевойЛист) И ЗначениеЗаполнено(ТС)
		И ТС <> ПутевойЛист.ТранспортноеСредство И ПутевойЛист.Прицепы.Найти(ТС, "ТС") = Неопределено Тогда
		уатОбщегоНазначенияТиповые.СообщитьОбОшибке(
			СтрШаблон("ТС ""%1"" отсутствует в указанном Путевом листе!", ТС),
			Отказ, Заголовок);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
